/* Unknown key. */
"Unknown" = "Unknown";

/* 'fn' key, with hyphen. Common on laptops. */
"fn-" = "fn-";

/* Modifier for numeric keypad, with hyphen. */
"Pad-" = "Pad-";                                                     

/* 'fn' key, no hyphen. Common on laptops. */
"fn" = "fn";

/* 'Insert' key. Not on most Macintosh keyboards. */
"Insert" = "Insert";                                                                                          

/* 'Begin' key. Not on most Macintosh keyboards. */
"Begin" = "Begin";                                                                                          

/* 'Print Screen' key. Not on most Macintosh keyboards. */
"Print Screen" = "Print Screen";            

/* 'Scroll lock' key. Not on most Macintosh keyboards. */
"Scroll Lock" = "Scroll Lock";            

/* 'Pause' key. Not on most Macintosh keyboards. */
"Pause" = "Pause";            

/* 'System Request' key. Not on most Macintosh keyboards. */
"System Request" = "System Request";            

/* 'Break' key. Not on most Macintosh keyboards. */
"Break" = "Break";            

/* 'Reset' key. Not on most Macintosh keyboards. */
"Reset" = "Reset";            

/* 'Stop' key. Not on most Macintosh keyboards. */
"Stop" = "Stop";            

/* 'Menu' key. Not on most Macintosh keyboards. */
"Menu" = "Menu";            

/* 'User' key. Not on most Macintosh keyboards. */
"User" = "User";            

/* 'System' key. Not on most Macintosh keyboards. */
"System" = "System";            

/* 'Print' key. Not on most Macintosh keyboards. */
"Print" = "Print";            

/* 'Clear' key. Not on most Macintosh keyboards. */
"Clear" = "Clear";            

/* 'Insert Line' key. Not on most Macintosh keyboards. */
"Insert Line" = "Insert Line";            

/* 'Delete Line' key. Not on most Macintosh keyboards. */
"Delete Line" = "Delete Line";            

/* 'Insert Char' key. Not on most Macintosh keyboards. */
"Insert Char" = "Insert Char";            

/* 'Delete Char' key. Not on most Macintosh keyboards. */
"Delete Char" = "Delete Char";            

/* 'Previous' key. Not on most Macintosh keyboards. */
"Previous" = "Previous";            

/* 'Next' key. Not on most Macintosh keyboards. */
"Next" = "Next";            

/* 'Select' key. Not on most Macintosh keyboards. */
"Select" = "Select";            

/* 'Execute' key. Not on most Macintosh keyboards. */
"Execute" = "Execute";            

/* 'Undo' key. Not on most Macintosh keyboards. */
"Undo" = "Undo";            

/* 'Redo' key. Not on most Macintosh keyboards. */
"Redo" = "Redo";            

/* 'Find' key. Not on most Macintosh keyboards. */
"Find" = "Find";            

/* 'Mode Switch' key. Not on most Macintosh keyboards. */
"Mode Switch" = "Mode Switch";

/* 'Space' key. */
"Space" = "Space";